# Написать программу, подсчитывающую количество цифр числа, использую для этого функцию
def count(k):
    t = 0
    while k > 0:
        t += 1
        k //= 10
    return t


a = int(input('Введите число - '))


print(f'Количество цифр в числе равно: {count(a)}')