# Организовать и вывести последовательность А из n чисел (n - четное). Из
# последовательности А получить две последовательности В и С: в последовательности В –
# первая половина элементов А, в С – вторая половина элементов А. Найти произведение
# соответствующих элементов последовательностей В и С. Найти среднее арифметической
# полученной последовательности.

import random
n = int(input('Введите четное число - '))


A = [random.randint(-100,100) for i in range(n)]
half = len(A) // 2
B, C = A[:half], A[half:]

ex_1 = [b * c for b, c in zip(B, C)]
ex_2 = sum(ex_1) // len(ex_1)


print(f'Последовательность A: {A}\nПоследовательность B: {B}\nПоследовательность C: {C}\n'
      f'Последовательность соответсвующих элементов: {ex_1}\nСреднее арифметическое: {ex_2}')