# Дано целое число N (>0). С помощью операций деления нацело и взятия остатка от
# деления определить, имеются ли в записи числа N нечетные цифры. Если имеются,
# то вывести TRUE, если нет — вывести FALSE.

N = input('Введите положительно число - ')

d = False

while type(N) != int: # проверка на тип переменной
    try:
        N = int(N)
    except ValueError:
        print('Неправильно ввели')
        N = input('Введите положительно число - ')

while N > 0:
    a = N % 10 # берем последнюю цифру числа N
    if a % 2 != 0: # проверяем четная ли эта цифра
        d = True
        break
    N //= 10

print(d)