#Описать функцию Mean(параметры), вычисляющую среднее арифметическое
#AMean = (X+Y)/2 и среднее геометрическое GMean = y/X Y двух положительных
#чисел X и Y. С помощью этой функции найти среднее арифметическое и среднее
#геометрическое для пар (A, B), (A, C), (A, D), если даны A, B, C, D.

def mean(x, y):
    AMean = (x + y)/2
    GMean = (y/x) * y
    return AMean, GMean

A, B =  int(input('Введите положительное число A - ')), int(input('Введите положительное число B - '))
C, D = int(input('Введите положительное число C - ')), int(input('Введите положительное число D - '))
A_Mean, G_Mean = mean(A, B)
print(f'Среднее арифметическое для пары A, B = {A_Mean}\nСреднее геометрическое для этой пары = {G_Mean}')
A_Mean, G_Mean = mean(A, C)
print(f'Среднее арифметическое для пары A, C = {A_Mean}\nСреднее геометрическое для этой пары = {G_Mean}')
A_Mean, G_Mean = mean(A, D)
print(f'Среднее арифметическое для пары A, D = {A_Mean}\nСреднее геометрическое для этой пары = {G_Mean}')