#Описать функцию Mean(параметры), вычисляющую среднее арифметическое
#AMean = (X+Y)/2 и среднее геометрическое GMean = y/X Y двух положительных
#чисел X и Y. С помощью этой функции найти среднее арифметическое и среднее
#геометрическое для пар (A, B), (A, C), (A, D), если даны A, B, C, D.

def mean(x, y): #функция вычисляющая сред. ариф. и геометр. значение
    AMean = (x + y)/2
    GMean = (y/x) * y
    return AMean, GMean

A, B =  input('Введите положительное число A - '), input('Введите положительное число B - ')
C, D = input('Введите положительное число C - '), input('Введите положительное число D - ')
while type(A) != int or type(B) != int or type(C) != int or type(D) != int:  # проверка на тип переменной
    try:
        A = int(A)
        B = int(B)
        C = int(C)
        D = int(D)
    except ValueError:
        print("Неправильно ввели")
        A = int(input("Введите положительное число A - "))
        B = int(input('Введите положительное число B - '))
        C = int(input("Введите положительно число C -"))
        D = int(input("Введите положительное число D- "))
A_Mean, G_Mean = mean(A, B) #Присваиваем переменным значение функции с аргументами первой пары
print(f'Среднее арифметическое для пары A, B = {A_Mean}\nСреднее геометрическое для этой пары = {G_Mean}')
A_Mean, G_Mean = mean(A, C) #для второй пары
print(f'Среднее арифметическое для пары A, C = {A_Mean}\nСреднее геометрическое для этой пары = {G_Mean}')
A_Mean, G_Mean = mean(A, D) #для третьей
print(f'Среднее арифметическое для пары A, D = {A_Mean}\nСреднее геометрическое для этой пары = {G_Mean}')