# Известно, что X кг шоколадных конфет стоит А рублей, а Y кг ирисок стоит В рублей.
# Определить, сколько стоит 1 кг шоколадных
# конфет, 1 кг ирисок, а также во сколько раз
# шоколадные конфеты дороже ирисок.
X = int(input("Количество шоколадных конфет (кг) - "))
Y = int(input('Количество ирисок (кг) - '))
A = int(input('Стоимость шоколадных конфет за определенное количество (руб) - '))
B = int(input("Стоимость ирисок за определенное количество (руб) - "))
while type(A) != int or type(B) != int or type(X) != int or type(Y) != int:  # проверка на тип переменной
    try:
        A = int(A)
        B = int(B)
        X = int(X)
        Y = int(Y)
    except ValueError:
        print("Неправильно ввели")
        X = int(input("Количество шоколадных конфет (кг) - "))
        Y = int(input('Количество ирисок (кг) - '))
        A = int(input("Стоимость шкоколадных конфет (руб) -"))
        B = int(input("Стоимость ирисок (руб)- "))
kg_chok = A / X  # выясняем сколько стоит 1 кг шоколадных конфет
kg_iris = B / Y  # выясняем сколько стояит 1 кг ирисок
razn = kg_chok / kg_iris  # ищем разницу цены
razn = int(razn)
print(f'1 кг шоколадных конфет стоит - {kg_chok}рублей\n1 кг ирисок стоит - {kg_iris} рублей\nШоколадные конфеты дороже ирисок в {razn} раз') # выводим ответ
