#Дан символ C. Вывести его код (то есть номер в кодовой таблице).
C = input('Введите любой символ - ')
print(f'Номер данного символа в кодовой таблице - {ord(C)}')