#Дан символ C. Вывести его код (то есть номер в кодовой таблице).
print(ord(input('Введите любой символ - ')))