# При открытии вклада в банке установлены следующие годовые проценты: при
# вкладе до 50000р. процент составит 4%; при вкладе от 50000р. до 100000р. процент
# составит 5%; при вкладе от 100000р. до 150000р. скидка составит 6%; при вкладе от
# 150000 р. до 200000 р. процент составит 7%. Составить программу, определяющую
# процентной ставки в зависимости от вносимой суммы.
vklad = input('Введите сумму вклада (руб) - ')
while type(vklad) != int:  # проверка на тип переменной
    try:
        vklad = int(vklad)
    except ValueError:
        print("Неправильно ввели")
        vklad = input("Введите сумму вклада правильно - ")
if vklad < 50000:
    procent = 4
elif 50000 < vklad < 100000:
    procent = 5
elif 100000 < vklad < 150000:
    procent = 6
elif 150000 < vklad < 200000:
    procent = 7
else:
    procent = 'Такая сумма не предусмотрена'
# Проверяем тип переменной в зависимости от
# нее выводим ответ
if type(procent) == int:
    print(f'Ваш процент ставки - {procent}%')
else:
    print('Такая сумма не предусмотрена')
